{"class_name": "Model", "config": {"name": "ResNet1D", "layers": [{"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2500, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "zero_padding1d_11", "class_name": "ZeroPadding1D", "config": {"name": "zero_padding1d_11", "trainable": true, "dtype": "float32", "padding": [0, 0]}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv1D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding1d_11", 0, 0, {}]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"name": "bn_conv1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_990", "class_name": "Activation", "config": {"name": "activation_990", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "res2a_branch2a", "class_name": "Conv1D", "config": {"name": "res2a_branch2a", "trainable": true, "batch_input_shape": [null, null, 2500, 16], "dtype": "float32", "filters": 16, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_990", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_991", "class_name": "Activation", "config": {"name": "activation_991", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "dropout_539", "class_name": "Dropout", "config": {"name": "dropout_539", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_991", 0, 0, {}]]]}, {"name": "res2a_branch1", "class_name": "Conv1D", "config": {"name": "res2a_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_990", 0, 0, {}]]]}, {"name": "res2a_branch2b", "class_name": "Conv1D", "config": {"name": "res2a_branch2b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_539", 0, 0, {}]]]}, {"name": "mp2a_branch1", "class_name": "MaxPooling1D", "config": {"name": "mp2a_branch1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [1], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_308", "class_name": "Add", "config": {"name": "add_308", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}], ["mp2a_branch1", 0, 0, {}]]]}, {"name": "activation_992", "class_name": "Activation", "config": {"name": "activation_992", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_308", 0, 0, {}]]]}, {"name": "res2b_branch2a", "class_name": "Conv1D", "config": {"name": "res2b_branch2a", "trainable": true, "batch_input_shape": [null, null, 2500, 32], "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_992", 0, 0, {}]]]}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"name": "activation_993", "class_name": "Activation", "config": {"name": "activation_993", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"name": "dropout_540", "class_name": "Dropout", "config": {"name": "dropout_540", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_993", 0, 0, {}]]]}, {"name": "res2b_branch2b", "class_name": "Conv1D", "config": {"name": "res2b_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_540", 0, 0, {}]]]}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"name": "activation_994", "class_name": "Activation", "config": {"name": "activation_994", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"name": "dropout_541", "class_name": "Dropout", "config": {"name": "dropout_541", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_994", 0, 0, {}]]]}, {"name": "res2b_branch2c", "class_name": "Conv1D", "config": {"name": "res2b_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_541", 0, 0, {}]]]}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"name": "add_309", "class_name": "Add", "config": {"name": "add_309", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_992", 0, 0, {}]]]}, {"name": "activation_995", "class_name": "Activation", "config": {"name": "activation_995", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_309", 0, 0, {}]]]}, {"name": "res2c_branch2a", "class_name": "Conv1D", "config": {"name": "res2c_branch2a", "trainable": true, "batch_input_shape": [null, null, 2500, 32], "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_995", 0, 0, {}]]]}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"name": "activation_996", "class_name": "Activation", "config": {"name": "activation_996", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"name": "dropout_542", "class_name": "Dropout", "config": {"name": "dropout_542", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_996", 0, 0, {}]]]}, {"name": "res2c_branch2b", "class_name": "Conv1D", "config": {"name": "res2c_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_542", 0, 0, {}]]]}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"name": "activation_997", "class_name": "Activation", "config": {"name": "activation_997", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"name": "dropout_543", "class_name": "Dropout", "config": {"name": "dropout_543", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_997", 0, 0, {}]]]}, {"name": "res2c_branch2c", "class_name": "Conv1D", "config": {"name": "res2c_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_543", 0, 0, {}]]]}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"name": "add_310", "class_name": "Add", "config": {"name": "add_310", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_995", 0, 0, {}]]]}, {"name": "activation_998", "class_name": "Activation", "config": {"name": "activation_998", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_310", 0, 0, {}]]]}, {"name": "res2d_branch2a", "class_name": "Conv1D", "config": {"name": "res2d_branch2a", "trainable": true, "batch_input_shape": [null, null, 2500, 32], "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_998", 0, 0, {}]]]}, {"name": "bn2d_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2d_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2d_branch2a", 0, 0, {}]]]}, {"name": "activation_999", "class_name": "Activation", "config": {"name": "activation_999", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2d_branch2a", 0, 0, {}]]]}, {"name": "dropout_544", "class_name": "Dropout", "config": {"name": "dropout_544", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_999", 0, 0, {}]]]}, {"name": "res2d_branch2b", "class_name": "Conv1D", "config": {"name": "res2d_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [24], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_544", 0, 0, {}]]]}, {"name": "bn2d_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2d_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2d_branch2b", 0, 0, {}]]]}, {"name": "activation_1000", "class_name": "Activation", "config": {"name": "activation_1000", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2d_branch2b", 0, 0, {}]]]}, {"name": "dropout_545", "class_name": "Dropout", "config": {"name": "dropout_545", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1000", 0, 0, {}]]]}, {"name": "res2d_branch2c", "class_name": "Conv1D", "config": {"name": "res2d_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_545", 0, 0, {}]]]}, {"name": "bn2d_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2d_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2d_branch2c", 0, 0, {}]]]}, {"name": "activation_1001", "class_name": "Activation", "config": {"name": "activation_1001", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2d_branch2c", 0, 0, {}]]]}, {"name": "res2d_branch1", "class_name": "Conv1D", "config": {"name": "res2d_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_998", 0, 0, {}]]]}, {"name": "dropout_546", "class_name": "Dropout", "config": {"name": "dropout_546", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1001", 0, 0, {}]]]}, {"name": "bn2d_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2d_branch1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2d_branch1", 0, 0, {}]]]}, {"name": "add_311", "class_name": "Add", "config": {"name": "add_311", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dropout_546", 0, 0, {}], ["bn2d_branch1", 0, 0, {}]]]}, {"name": "activation_1002", "class_name": "Activation", "config": {"name": "activation_1002", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_311", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_1002", 0, 0, {}]]]}, {"name": "activation_1003", "class_name": "Activation", "config": {"name": "activation_1003", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2b", "class_name": "Conv1D", "config": {"name": "res3a_branch2b", "trainable": true, "batch_input_shape": [null, null, 2500, 32], "dtype": "float32", "filters": 16, "kernel_size": [5], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1003", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "activation_1004", "class_name": "Activation", "config": {"name": "activation_1004", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"name": "dropout_547", "class_name": "Dropout", "config": {"name": "dropout_547", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1004", 0, 0, {}]]]}, {"name": "res3a_branch1", "class_name": "Conv1D", "config": {"name": "res3a_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1002", 0, 0, {}]]]}, {"name": "res3a_branch2c", "class_name": "Conv1D", "config": {"name": "res3a_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_547", 0, 0, {}]]]}, {"name": "mp3a_branch1", "class_name": "MaxPooling1D", "config": {"name": "mp3a_branch1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_312", "class_name": "Add", "config": {"name": "add_312", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}], ["mp3a_branch1", 0, 0, {}]]]}, {"name": "activation_1005", "class_name": "Activation", "config": {"name": "activation_1005", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_312", 0, 0, {}]]]}, {"name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_1005", 0, 0, {}]]]}, {"name": "activation_1006", "class_name": "Activation", "config": {"name": "activation_1006", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"name": "res3b_branch2b", "class_name": "Conv1D", "config": {"name": "res3b_branch2b", "trainable": true, "batch_input_shape": [null, null, 1250, 32], "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1006", 0, 0, {}]]]}, {"name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"name": "activation_1007", "class_name": "Activation", "config": {"name": "activation_1007", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"name": "dropout_548", "class_name": "Dropout", "config": {"name": "dropout_548", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1007", 0, 0, {}]]]}, {"name": "res3b_branch1", "class_name": "Conv1D", "config": {"name": "res3b_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1005", 0, 0, {}]]]}, {"name": "res3b_branch2c", "class_name": "Conv1D", "config": {"name": "res3b_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_548", 0, 0, {}]]]}, {"name": "mp3b_branch1", "class_name": "MaxPooling1D", "config": {"name": "mp3b_branch1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [1], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["res3b_branch1", 0, 0, {}]]]}, {"name": "add_313", "class_name": "Add", "config": {"name": "add_313", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}], ["mp3b_branch1", 0, 0, {}]]]}, {"name": "activation_1008", "class_name": "Activation", "config": {"name": "activation_1008", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_313", 0, 0, {}]]]}, {"name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_1008", 0, 0, {}]]]}, {"name": "activation_1009", "class_name": "Activation", "config": {"name": "activation_1009", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"name": "res3d_branch2b", "class_name": "Conv1D", "config": {"name": "res3d_branch2b", "trainable": true, "batch_input_shape": [null, null, 1250, 32], "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1009", 0, 0, {}]]]}, {"name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"name": "activation_1010", "class_name": "Activation", "config": {"name": "activation_1010", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"name": "dropout_549", "class_name": "Dropout", "config": {"name": "dropout_549", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1010", 0, 0, {}]]]}, {"name": "res3d_branch1", "class_name": "Conv1D", "config": {"name": "res3d_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1008", 0, 0, {}]]]}, {"name": "res3d_branch2c", "class_name": "Conv1D", "config": {"name": "res3d_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_549", 0, 0, {}]]]}, {"name": "mp3d_branch1", "class_name": "MaxPooling1D", "config": {"name": "mp3d_branch1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["res3d_branch1", 0, 0, {}]]]}, {"name": "add_314", "class_name": "Add", "config": {"name": "add_314", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}], ["mp3d_branch1", 0, 0, {}]]]}, {"name": "activation_1011", "class_name": "Activation", "config": {"name": "activation_1011", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_314", 0, 0, {}]]]}, {"name": "res3e_branch2a", "class_name": "Conv1D", "config": {"name": "res3e_branch2a", "trainable": true, "batch_input_shape": [null, null, 625, 32], "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1011", 0, 0, {}]]]}, {"name": "bn3e_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3e_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3e_branch2a", 0, 0, {}]]]}, {"name": "activation_1012", "class_name": "Activation", "config": {"name": "activation_1012", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3e_branch2a", 0, 0, {}]]]}, {"name": "dropout_550", "class_name": "Dropout", "config": {"name": "dropout_550", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1012", 0, 0, {}]]]}, {"name": "res3e_branch2b", "class_name": "Conv1D", "config": {"name": "res3e_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_550", 0, 0, {}]]]}, {"name": "bn3e_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3e_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3e_branch2b", 0, 0, {}]]]}, {"name": "activation_1013", "class_name": "Activation", "config": {"name": "activation_1013", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3e_branch2b", 0, 0, {}]]]}, {"name": "dropout_551", "class_name": "Dropout", "config": {"name": "dropout_551", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1013", 0, 0, {}]]]}, {"name": "res3e_branch2c", "class_name": "Conv1D", "config": {"name": "res3e_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_551", 0, 0, {}]]]}, {"name": "bn3e_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3e_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3e_branch2c", 0, 0, {}]]]}, {"name": "add_315", "class_name": "Add", "config": {"name": "add_315", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn3e_branch2c", 0, 0, {}], ["activation_1011", 0, 0, {}]]]}, {"name": "activation_1014", "class_name": "Activation", "config": {"name": "activation_1014", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_315", 0, 0, {}]]]}, {"name": "res3f_branch2a", "class_name": "Conv1D", "config": {"name": "res3f_branch2a", "trainable": true, "batch_input_shape": [null, null, 625, 32], "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1014", 0, 0, {}]]]}, {"name": "bn3f_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3f_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3f_branch2a", 0, 0, {}]]]}, {"name": "activation_1015", "class_name": "Activation", "config": {"name": "activation_1015", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3f_branch2a", 0, 0, {}]]]}, {"name": "dropout_552", "class_name": "Dropout", "config": {"name": "dropout_552", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1015", 0, 0, {}]]]}, {"name": "res3f_branch2b", "class_name": "Conv1D", "config": {"name": "res3f_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_552", 0, 0, {}]]]}, {"name": "bn3f_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3f_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3f_branch2b", 0, 0, {}]]]}, {"name": "activation_1016", "class_name": "Activation", "config": {"name": "activation_1016", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3f_branch2b", 0, 0, {}]]]}, {"name": "dropout_553", "class_name": "Dropout", "config": {"name": "dropout_553", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_1016", 0, 0, {}]]]}, {"name": "res3f_branch2c", "class_name": "Conv1D", "config": {"name": "res3f_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_553", 0, 0, {}]]]}, {"name": "bn3f_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3f_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3f_branch2c", 0, 0, {}]]]}, {"name": "add_316", "class_name": "Add", "config": {"name": "add_316", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn3f_branch2c", 0, 0, {}], ["activation_1014", 0, 0, {}]]]}, {"name": "activation_1017", "class_name": "Activation", "config": {"name": "activation_1017", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_316", 0, 0, {}]]]}, {"name": "res3g_branch2a", "class_name": "Conv1D", "config": {"name": "res3g_branch2a", "trainable": true, "batch_input_shape": [null, null, 625, 32], "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": 