{"class_name": "Model", "config": {"name": "ResNet_Inc_LSTM", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2500, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "zero_padding1d_10", "class_name": "ZeroPadding1D", "config": {"name": "zero_padding1d_10", "trainable": true, "dtype": "float32", "padding": [0, 0]}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv1D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding1d_10", 0, 0, {}]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"name": "bn_conv1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_860", "class_name": "Activation", "config": {"name": "activation_860", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "res2A_branch2a", "class_name": "Conv1D", "config": {"name": "res2A_branch2a", "trainable": true, "batch_input_shape": [null, null, 2500, 16], "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_860", 0, 0, {}]]]}, {"name": "bn2A_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2a", 0, 0, {}]]]}, {"name": "activation_861", "class_name": "Activation", "config": {"name": "activation_861", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch2a", 0, 0, {}]]]}, {"name": "dropout_420", "class_name": "Dropout", "config": {"name": "dropout_420", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_861", 0, 0, {}]]]}, {"name": "res2A_branch1", "class_name": "Conv1D", "config": {"name": "res2A_branch1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_860", 0, 0, {}]]]}, {"name": "bn2A_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch1", 0, 0, {}]]]}, {"name": "res2A_branch4sha", "class_name": "Conv1D", "config": {"name": "res2A_branch4sha", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_420", 0, 0, {}]]]}, {"name": "activation_863", "class_name": "Activation", "config": {"name": "activation_863", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch1", 0, 0, {}]]]}, {"name": "bn2A_branch4sha", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch4sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch4sha", 0, 0, {}]]]}, {"name": "res2A_branch2sha", "class_name": "Conv1D", "config": {"name": "res2A_branch2sha", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_863", 0, 0, {}]]]}, {"name": "activation_867", "class_name": "Activation", "config": {"name": "activation_867", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch4sha", 0, 0, {}]]]}, {"name": "res2A_branch2b", "class_name": "Conv1D", "config": {"name": "res2A_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_420", 0, 0, {}]]]}, {"name": "bn2A_branch2sha", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2sha", 0, 0, {}]]]}, {"name": "dropout_423", "class_name": "Dropout", "config": {"name": "dropout_423", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_867", 0, 0, {}]]]}, {"name": "bn2A_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2b", 0, 0, {}]]]}, {"name": "activation_864", "class_name": "Activation", "config": {"name": "activation_864", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch2sha", 0, 0, {}]]]}, {"name": "res2A_branch4shb", "class_name": "Conv1D", "config": {"name": "res2A_branch4shb", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_423", 0, 0, {}]]]}, {"name": "activation_862", "class_name": "Activation", "config": {"name": "activation_862", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch2b", 0, 0, {}]]]}, {"name": "add_180", "class_name": "Add", "config": {"name": "add_180", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_863", 0, 0, {}], ["activation_860", 0, 0, {}]]]}, {"name": "dropout_422", "class_name": "Dropout", "config": {"name": "dropout_422", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_864", 0, 0, {}]]]}, {"name": "bn2A_branch4shb", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch4shb", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch4shb", 0, 0, {}]]]}, {"name": "dropout_421", "class_name": "Dropout", "config": {"name": "dropout_421", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_862", 0, 0, {}]]]}, {"name": "res2A_branch3sha", "class_name": "Conv1D", "config": {"name": "res2A_branch3sha", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_180", 0, 0, {}]]]}, {"name": "res2A_branch2shb", "class_name": "Conv1D", "config": {"name": "res2A_branch2shb", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_422", 0, 0, {}]]]}, {"name": "activation_868", "class_name": "Activation", "config": {"name": "activation_868", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch4shb", 0, 0, {}]]]}, {"name": "res2A_branch2c", "class_name": "Conv1D", "config": {"name": "res2A_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_421", 0, 0, {}]]]}, {"name": "bn2A_branch3sha", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch3sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch3sha", 0, 0, {}]]]}, {"name": "bn2A_branch2shb", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2shb", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2shb", 0, 0, {}]]]}, {"name": "bn2A_branch5sha", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch5sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_868", 0, 0, {}]]]}, {"name": "bn2A_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2c", 0, 0, {}]]]}, {"name": "activation_866", "class_name": "Activation", "config": {"name": "activation_866", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch3sha", 0, 0, {}]]]}, {"name": "activation_865", "class_name": "Activation", "config": {"name": "activation_865", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch2shb", 0, 0, {}]]]}, {"name": "activation_869", "class_name": "Activation", "config": {"name": "activation_869", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch5sha", 0, 0, {}]]]}, {"name": "add_181", "class_name": "Add", "config": {"name": "add_181", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn2A_branch2c", 0, 0, {}], ["activation_866", 0, 0, {}], ["activation_865", 0, 0, {}], ["activation_868", 0, 0, {}], ["activation_869", 0, 0, {}]]]}, {"name": "activation_870", "class_name": "Activation", "config": {"name": "activation_870", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_181", 0, 0, {}]]]}, {"name": "res2a_branch2a", "class_name": "Conv1D", "config": {"name": "res2a_branch2a", "trainable": true, "batch_input_shape": [null, null, 2500, 32], "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_870", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_871", "class_name": "Activation", "config": {"name": "activation_871", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "dropout_424", "class_name": "Dropout", "config": {"name": "dropout_424", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_871", 0, 0, {}]]]}, {"name": "res2a_branch2b", "class_name": "Conv1D", "config": {"name": "res2a_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_424", 0, 0, {}]]]}, {"name": "activation_872", "class_name": "Activation", "config": {"name": "activation_872", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "dropout_425", "class_name": "Dropout", "config": {"name": "dropout_425", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_872", 0, 0, {}]]]}, {"name": "res2a_branch2c", "class_name": "Conv1D", "config": {"name": "res2a_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_425", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "activation_873", "class_name": "Activation", "config": {"name": "activation_873", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}]]]}, {"name": "res2a_branch1", "class_name": "Conv1D", "config": {"name": "res2a_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_870", 0, 0, {}]]]}, {"name": "dropout_426", "class_name": "Dropout", "config": {"name": "dropout_426", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_873", 0, 0, {}]]]}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_182", "class_name": "Add", "config": {"name": "add_182", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dropout_426", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_874", "class_name": "Activation", "config": {"name": "activation_874", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_182", 0, 0, {}]]]}, {"name": "res3A_branch2a", "class_name": "Conv1D", "config": {"name": "res3A_branch2a", "trainable": true, "batch_input_shape": [null, null, 1250, 32], "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_874", 0, 0, {}]]]}, {"name": "bn3A_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2a", 0, 0, {}]]]}, {"name": "activation_875", "class_name": "Activation", "config": {"name": "activation_875", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch2a", 0, 0, {}]]]}, {"name": "dropout_427", "class_name": "Dropout", "config": {"name": "dropout_427", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_875", 0, 0, {}]]]}, {"name": "res3A_branch1", "class_name": "Conv1D", "config": {"name": "res3A_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_874", 0, 0, {}]]]}, {"name": "bn3A_branch1", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch1", 0, 0, {}]]]}, {"name": "res3A_branch4sha", "class_name": "Conv1D", "config": {"name": "res3A_branch4sha", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_427", 0, 0, {}]]]}, {"name": "activation_877", "class_name": "Activation", "config": {"name": "activation_877", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch1", 0, 0, {}]]]}, {"name": "bn3A_branch4sha", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch4sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch4sha", 0, 0, {}]]]}, {"name": "res3A_branch2sha", "class_name": "Conv1D", "config": {"name": "res3A_branch2sha", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_877", 0, 0, {}]]]}, {"name": "activation_881", "class_name": "Activation", "config": {"name": "activation_881", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch4sha", 0, 0, {}]]]}, {"name": "res3A_branch2b", "class_name": "Conv1D", "config": {"name": "res3A_branch2b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_427", 0, 0, {}]]]}, {"name": "bn3A_branch2sha", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2sha", 0, 0, {}]]]}, {"name": "dropout_430", "class_name": "Dropout", "config": {"name": "dropout_430", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_881", 0, 0, {}]]]}, {"name": "bn3A_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2b", 0, 0, {}]]]}, {"name": "activation_878", "class_name": "Activation", "config": {"name": "activation_878", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch2sha", 0, 0, {}]]]}, {"name": "res3A_branch4shb", "class_name": "Conv1D", "config": {"name": "res3A_branch4shb", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_430", 0, 0, {}]]]}, {"name": "activation_876", "class_name": "Activation", "config": {"name": "activation_876", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch2b", 0, 0, {}]]]}, {"name": "add_183", "class_name": "Add", "config": {"name": "add_183", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_877", 0, 0, {}], ["activation_874", 0, 0, {}]]]}, {"name": "dropout_429", "class_name": "Dropout", "config": {"name": "dropout_429", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_878", 0, 0, {}]]]}, {"name": "bn3A_branch4shb", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch4shb", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch4shb", 0, 0, {}]]]}, {"name": "dropout_428", "class_name": "Dropout", "config": {"name": "dropout_428", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_876", 0, 0, {}]]]}, {"name": "res3A_branch3sha", "class_name": "Conv1D", "config": {"name": "res3A_branch3sha", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_183", 0, 0, {}]]]}, {"name": "res3A_branch2shb", "class_name": "Conv1D", "config": {"name": "res3A_branch2shb", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_429", 0, 0, {}]]]}, {"name": "activation_882", "class_name": "Activation", "config": {"name": "activation_882", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch4shb", 0, 0, {}]]]}, {"name": "res3A_branch2c", "class_name": "Conv1D", "config": {"name": "res3A_branch2c", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_428", 0, 0, {}]]]}, {"name": "bn3A_branch3sha", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch3sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch3sha", 0, 0, {}]]]}, {"name": "bn3A_branch2shb", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2shb", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2shb", 0, 0, {}]]]}, {"name": "bn3A_branch5sha", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch5sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_882", 0, 0, {}]]]}, {"name": "bn3A_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2c", 0, 0, {}]]]}, {"name": "activation_880", "class_name": "Activation", "config": {"name": "activation_880", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch3sha", 0, 0, {}]]]}, {"name": "activation_879", "class_name": "Activation", "config": {"name": "activation_879", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch2shb", 0, 0, {}]]]}, {"name": "activation_883", "class_name": "Activation", "config": {"name": "activation_883", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch5sha", 0, 0, {}]]]}, {"name": "add_184", "class_name": "Add", "config": {"name": "add_184", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn3A_branch2c", 0, 0, {}], ["activation_880", 0, 0, {}], ["activation_879", 0, 0, {}], ["activation_882", 0, 0, {}], ["activation_883", 0, 0, {}]]]}, {"name": "activation_884", "class_name": "Activation", "config": {"name": "activation_884", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_184", 0, 0, {}]]]}, {"name": "res3a_branch2a", "class_name": "Conv1D", "config": {"name": "res3a_branch2a", "trainable": true, "batch_input_shape": [null, null, 1250, 64], "dtype": "float32", "filters": 32, "kernel_size": [7], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_884", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "activation_885", "class_name": "Activation", "config": {"name": "activation_885", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "dropout_431", "class_name": "Dropout", "config": {"name": "dropout_431", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_885", 0, 0, {}]]]}, {"name": "res3a_branch2b", "class_name": "Conv1D", "config": {"name": "res3a_branch2b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_431", 0, 0, {}]]]}, {"name": "activation_886", "class_name": "Activation", "config": {"name": "activation_886", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "dropout_432", "class_name": "Dropout", "config": {"name": "dropout_432", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_886", 0, 0, {}]]]}, {"name": "res3a_branch2c", "class_name": "Conv1D", "config": {"name": "res3a_branch2c", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_432", 0, 0, {}]]]}, {"name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"name": "activation_887", "class_name": "Activation", "config": {"name": "activation_887", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}]]]}, {"name": "res3a_branch1", "class_name": "Conv1D", "config": {"name": "res3a_branch1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_884", 0, 0, {}]]]}, {"name": "dropout_433", "class_name": "Dropout", "config": {"name": "dropout_433", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_887", 0, 0, {}]]]}, {"name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_185", "class_name": "Add", "config": {"name": "add_185", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dropout_433", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "activation_888", "class_name": "Activation", "config": {"name": "activation_888", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_185", 0, 0, {}]]]}, {"name": "res4A_branch2a", "class_name": "Conv1D", "config": {"name": "res4A_branch2a", "trainable": true, "batch_input_shape": [null, null, 625, 64], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", 