{"class_name": "Model", "config": {"name": "ResNet_Inc_LSTM", "layers": [{"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2500, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "conv1conv1d", "class_name": "Conv1D", "config": {"name": "conv1conv1d", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [19], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "conv1conv1dbn", "class_name": "BatchNormalization", "config": {"name": "conv1conv1dbn", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1conv1d", 0, 0, {}]]]}, {"name": "conv1conv1dact", "class_name": "Activation", "config": {"name": "conv1conv1dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv1conv1dbn", 0, 0, {}]]]}, {"name": "conv2conv1d", "class_name": "Conv1D", "config": {"name": "conv2conv1d", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [19], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1conv1dact", 0, 0, {}]]]}, {"name": "conv2conv1dbn", "class_name": "BatchNormalization", "config": {"name": "conv2conv1dbn", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2conv1d", 0, 0, {}]]]}, {"name": "conv2conv1dact", "class_name": "Activation", "config": {"name": "conv2conv1dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2conv1dbn", 0, 0, {}]]]}, {"name": "conv3conv1d", "class_name": "Conv1D", "config": {"name": "conv3conv1d", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [19], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2conv1dact", 0, 0, {}]]]}, {"name": "conv3conv1dbn", "class_name": "BatchNormalization", "config": {"name": "conv3conv1dbn", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3conv1d", 0, 0, {}]]]}, {"name": "conv3conv1dact", "class_name": "Activation", "config": {"name": "conv3conv1dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3conv1dbn", 0, 0, {}]]]}, {"name": "stem_br_12conv1d", "class_name": "Conv1D", "config": {"name": "stem_br_12conv1d", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [19], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3conv1dact", 0, 0, {}]]]}, {"name": "stem_br_12conv1dbn", "class_name": "BatchNormalization", "config": {"name": "stem_br_12conv1dbn", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_br_12conv1d", 0, 0, {}]]]}, {"name": "stem_br_11_maxpool_1d", "class_name": "MaxPooling1D", "config": {"name": "stem_br_11_maxpool_1d", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [3], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv3conv1dact", 0, 0, {}]]]}, {"name": "stem_br_12conv1dact", "class_name": "Activation", "config": {"name": "stem_br_12conv1dact", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stem_br_12conv1dbn", 0, 0, {}]]]}, {"name": "stem_concat_1", "class_name": "Concatenate", "config": {"name": "stem_concat_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["stem_br_11_maxpool_1d", 0, 0, {}], ["stem_br_12conv1dact", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv1D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_concat_1", 0, 0, {}]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"name": "bn_conv1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_432", "class_name": "Activation", "config": {"name": "activation_432", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "stem_br_12_maxpool_1d", "class_name": "MaxPooling1D", "config": {"name": "stem_br_12_maxpool_1d", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [3], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["activation_432", 0, 0, {}]]]}, {"name": "res2A_branch2a", "class_name": "Conv1D", "config": {"name": "res2A_branch2a", "trainable": true, "batch_input_shape": [null, null, 1250, 16], "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_br_12_maxpool_1d", 0, 0, {}]]]}, {"name": "bn2A_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2a", 0, 0, {}]]]}, {"name": "activation_433", "class_name": "Activation", "config": {"name": "activation_433", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch2a", 0, 0, {}]]]}, {"name": "dropout_210", "class_name": "Dropout", "config": {"name": "dropout_210", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_433", 0, 0, {}]]]}, {"name": "res2A_branch1", "class_name": "Conv1D", "config": {"name": "res2A_branch1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stem_br_12_maxpool_1d", 0, 0, {}]]]}, {"name": "bn2A_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch1", 0, 0, {}]]]}, {"name": "res2A_branch4sha", "class_name": "Conv1D", "config": {"name": "res2A_branch4sha", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_210", 0, 0, {}]]]}, {"name": "activation_435", "class_name": "Activation", "config": {"name": "activation_435", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch1", 0, 0, {}]]]}, {"name": "bn2A_branch4sha", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch4sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch4sha", 0, 0, {}]]]}, {"name": "res2A_branch2sha", "class_name": "Conv1D", "config": {"name": "res2A_branch2sha", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_435", 0, 0, {}]]]}, {"name": "activation_439", "class_name": "Activation", "config": {"name": "activation_439", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch4sha", 0, 0, {}]]]}, {"name": "res2A_branch2b", "class_name": "Conv1D", "config": {"name": "res2A_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_210", 0, 0, {}]]]}, {"name": "bn2A_branch2sha", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2sha", 0, 0, {}]]]}, {"name": "dropout_213", "class_name": "Dropout", "config": {"name": "dropout_213", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_439", 0, 0, {}]]]}, {"name": "bn2A_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2b", 0, 0, {}]]]}, {"name": "activation_436", "class_name": "Activation", "config": {"name": "activation_436", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch2sha", 0, 0, {}]]]}, {"name": "res2A_branch4shb", "class_name": "Conv1D", "config": {"name": "res2A_branch4shb", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_213", 0, 0, {}]]]}, {"name": "activation_434", "class_name": "Activation", "config": {"name": "activation_434", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch2b", 0, 0, {}]]]}, {"name": "add_90", "class_name": "Add", "config": {"name": "add_90", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_435", 0, 0, {}], ["stem_br_12_maxpool_1d", 0, 0, {}]]]}, {"name": "dropout_212", "class_name": "Dropout", "config": {"name": "dropout_212", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_436", 0, 0, {}]]]}, {"name": "bn2A_branch4shb", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch4shb", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch4shb", 0, 0, {}]]]}, {"name": "dropout_211", "class_name": "Dropout", "config": {"name": "dropout_211", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_434", 0, 0, {}]]]}, {"name": "res2A_branch3sha", "class_name": "Conv1D", "config": {"name": "res2A_branch3sha", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_90", 0, 0, {}]]]}, {"name": "res2A_branch2shb", "class_name": "Conv1D", "config": {"name": "res2A_branch2shb", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_212", 0, 0, {}]]]}, {"name": "activation_440", "class_name": "Activation", "config": {"name": "activation_440", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch4shb", 0, 0, {}]]]}, {"name": "res2A_branch2c", "class_name": "Conv1D", "config": {"name": "res2A_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_211", 0, 0, {}]]]}, {"name": "bn2A_branch3sha", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch3sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch3sha", 0, 0, {}]]]}, {"name": "bn2A_branch2shb", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2shb", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2shb", 0, 0, {}]]]}, {"name": "bn2A_branch5sha", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch5sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_440", 0, 0, {}]]]}, {"name": "bn2A_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2A_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2A_branch2c", 0, 0, {}]]]}, {"name": "activation_438", "class_name": "Activation", "config": {"name": "activation_438", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch3sha", 0, 0, {}]]]}, {"name": "activation_437", "class_name": "Activation", "config": {"name": "activation_437", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch2shb", 0, 0, {}]]]}, {"name": "activation_441", "class_name": "Activation", "config": {"name": "activation_441", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2A_branch5sha", 0, 0, {}]]]}, {"name": "add_91", "class_name": "Add", "config": {"name": "add_91", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn2A_branch2c", 0, 0, {}], ["activation_438", 0, 0, {}], ["activation_437", 0, 0, {}], ["activation_440", 0, 0, {}], ["activation_441", 0, 0, {}]]]}, {"name": "activation_442", "class_name": "Activation", "config": {"name": "activation_442", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_91", 0, 0, {}]]]}, {"name": "res2a_branch2a", "class_name": "Conv1D", "config": {"name": "res2a_branch2a", "trainable": true, "batch_input_shape": [null, null, 1250, 32], "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_442", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_443", "class_name": "Activation", "config": {"name": "activation_443", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "dropout_214", "class_name": "Dropout", "config": {"name": "dropout_214", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_443", 0, 0, {}]]]}, {"name": "res2a_branch2b", "class_name": "Conv1D", "config": {"name": "res2a_branch2b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [13], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_214", 0, 0, {}]]]}, {"name": "activation_444", "class_name": "Activation", "config": {"name": "activation_444", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "dropout_215", "class_name": "Dropout", "config": {"name": "dropout_215", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_444", 0, 0, {}]]]}, {"name": "res2a_branch2c", "class_name": "Conv1D", "config": {"name": "res2a_branch2c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_215", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "activation_445", "class_name": "Activation", "config": {"name": "activation_445", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}]]]}, {"name": "res2a_branch1", "class_name": "Conv1D", "config": {"name": "res2a_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_442", 0, 0, {}]]]}, {"name": "dropout_216", "class_name": "Dropout", "config": {"name": "dropout_216", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_445", 0, 0, {}]]]}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_92", "class_name": "Add", "config": {"name": "add_92", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dropout_216", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_446", "class_name": "Activation", "config": {"name": "activation_446", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_92", 0, 0, {}]]]}, {"name": "res3A_branch2a", "class_name": "Conv1D", "config": {"name": "res3A_branch2a", "trainable": true, "batch_input_shape": [null, null, 625, 32], "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_446", 0, 0, {}]]]}, {"name": "bn3A_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2a", 0, 0, {}]]]}, {"name": "activation_447", "class_name": "Activation", "config": {"name": "activation_447", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch2a", 0, 0, {}]]]}, {"name": "dropout_217", "class_name": "Dropout", "config": {"name": "dropout_217", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_447", 0, 0, {}]]]}, {"name": "res3A_branch1", "class_name": "Conv1D", "config": {"name": "res3A_branch1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_446", 0, 0, {}]]]}, {"name": "bn3A_branch1", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch1", 0, 0, {}]]]}, {"name": "res3A_branch4sha", "class_name": "Conv1D", "config": {"name": "res3A_branch4sha", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_217", 0, 0, {}]]]}, {"name": "activation_449", "class_name": "Activation", "config": {"name": "activation_449", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch1", 0, 0, {}]]]}, {"name": "bn3A_branch4sha", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch4sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch4sha", 0, 0, {}]]]}, {"name": "res3A_branch2sha", "class_name": "Conv1D", "config": {"name": "res3A_branch2sha", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_449", 0, 0, {}]]]}, {"name": "activation_453", "class_name": "Activation", "config": {"name": "activation_453", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch4sha", 0, 0, {}]]]}, {"name": "res3A_branch2b", "class_name": "Conv1D", "config": {"name": "res3A_branch2b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_217", 0, 0, {}]]]}, {"name": "bn3A_branch2sha", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2sha", 0, 0, {}]]]}, {"name": "dropout_220", "class_name": "Dropout", "config": {"name": "dropout_220", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_453", 0, 0, {}]]]}, {"name": "bn3A_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2b", 0, 0, {}]]]}, {"name": "activation_450", "class_name": "Activation", "config": {"name": "activation_450", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch2sha", 0, 0, {}]]]}, {"name": "res3A_branch4shb", "class_name": "Conv1D", "config": {"name": "res3A_branch4shb", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_220", 0, 0, {}]]]}, {"name": "activation_448", "class_name": "Activation", "config": {"name": "activation_448", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch2b", 0, 0, {}]]]}, {"name": "add_93", "class_name": "Add", "config": {"name": "add_93", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_449", 0, 0, {}], ["activation_446", 0, 0, {}]]]}, {"name": "dropout_219", "class_name": "Dropout", "config": {"name": "dropout_219", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_450", 0, 0, {}]]]}, {"name": "bn3A_branch4shb", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch4shb", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch4shb", 0, 0, {}]]]}, {"name": "dropout_218", "class_name": "Dropout", "config": {"name": "dropout_218", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_448", 0, 0, {}]]]}, {"name": "res3A_branch3sha", "class_name": "Conv1D", "config": {"name": "res3A_branch3sha", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_93", 0, 0, {}]]]}, {"name": "res3A_branch2shb", "class_name": "Conv1D", "config": {"name": "res3A_branch2shb", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_219", 0, 0, {}]]]}, {"name": "activation_454", "class_name": "Activation", "config": {"name": "activation_454", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch4shb", 0, 0, {}]]]}, {"name": "res3A_branch2c", "class_name": "Conv1D", "config": {"name": "res3A_branch2c", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": 0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_218", 0, 0, {}]]]}, {"name": "bn3A_branch3sha", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch3sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch3sha", 0, 0, {}]]]}, {"name": "bn3A_branch2shb", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2shb", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2shb", 0, 0, {}]]]}, {"name": "bn3A_branch5sha", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch5sha", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_454", 0, 0, {}]]]}, {"name": "bn3A_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3A_branch2c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res3A_branch2c", 0, 0, {}]]]}, {"name": "activation_452", "class_name": "Activation", "config": {"name": "activation_452", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch3sha", 0, 0, {}]]]}, {"name": "activation_451", "class_name": "Activation", "config": {"name": "activation_451", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch2shb", 0, 0, {}]]]}, {"name": "activation_455", "class_name": "Activation", "config": {"name": "activation_455", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3A_branch5sha", 0, 0, {}]]]}, {"name": "add_94", "class_name": "Add", "config": {"name": "add_94", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn3A_branch2c", 0, 0, {}], ["activation_452", 0, 0, {}], ["activation_451", 0, 0, {}], ["activation_454", 0, 0, {}], ["activation_455", 0, 0, {}]]]}, {"name": "activation_456", "class_name": "Activation", "config": {"name": "activation_456", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_94", 0, 0, {}]]]}, {"name": "res3a_branch2a", 